while True:
    menu = input('1.Ввести повідомлення \n'
                 '2.Зашифрування повідомлення \n'
                 '3.Розшифрування повідомлення \n')
    radok = 'абвгґдеєжзиіїйклмнопрстуфхцчшщьюя'
    if menu =='1':
        vubir_1 = input('Ввести повідомлення-------->')
        print('Ваше повідомлення',vubir_1)

    if menu =='2':
        print('Зашифрувати повідомлення')
        d=int(input('Виберіть зміщення----->'))
        for i in vubir_1:
            a=ord(i)+int(d)
            b=chr(a)
            print(b)
    if menu=='3':
        print('Розшифрувати повідомлення')
        for i in vubir_1:
            a=ord(i)
            b=chr(a)
            print(b)
        print('Дякую, що скористалися моїми послугами')



